{
  "activation_dropout": 0.1,
  "activation_function": "gelu",
  "architectures": [
    "AutoformerForPrediction"
  ],
  "attention_dropout": 0.1,
  "autocorrelation_factor": 3,
  "cardinality": [
    4747
  ],
  "context_length": 65,
  "d_model": 64,
  "decoder_attention_heads": 2,
  "decoder_ffn_dim": 32,
  "decoder_layerdrop": 0.1,
  "decoder_layers": 2,
  "distribution_output": "student_t",
  "dropout": 0.1,
  "embedding_dimension": [
    50
  ],
  "encoder_attention_heads": 2,
  "encoder_ffn_dim": 32,
  "encoder_layerdrop": 0.1,
  "encoder_layers": 2,
  "feature_size": 63,
  "init_std": 0.02,
  "input_size": 1,
  "is_encoder_decoder": true,
  "label_length": 64,
  "lags_sequence": [
    1,
    2,
    3,
    4,
    5,
    6,
    7
  ],
  "loss": "nll",
  "model_type": "autoformer",
  "moving_average": 25,
  "num_dynamic_real_features": 0,
  "num_parallel_samples": 100,
  "num_static_categorical_features": 1,
  "num_static_real_features": 0,
  "num_time_features": 4,
  "prediction_length": 24,
  "scaling": true,
  "torch_dtype": "float32",
  "transformers_version": "4.33.2",
  "use_cache": true
}
